

#Завдання 1: Напишіть функцію, яка приймає довільну кількість числових аргументів і обчислює їх суму.

def suma(*args):
    return sum(args)


print(suma(10, 35, 5, 50))


#Завдання 5: Напишіть функцію, яка приймає довільну кількість рядків і обчислює кількість голосних літер у всіх рядках.

def голосні(*args):
    голосні = "aeiouAEIOUаеєиіїоуюяАЕЄИІЇОУЮЯ"
    кількість = 0
    for рядок in args:
        кількість += sum(1 for символ in рядок if символ in голосні)
    return кількість
print(голосні("Ні долі, ні волі у мене нема,"
                         "Зосталася тільки надія одна:"
                         "Надія вернутись ще раз на Вкраїну,"
                         "Поглянути ще раз на рідну країну,"
                         "Поглянути ще раз на синій Дніпро,–"
                         "Там жити чи вмерти, мені все одно;"
                         "Поглянути ще раз на степ, могилки,"
                         "Востаннє згадати палкії гадки…"
                         "Ні долі, ні волі у мене нема,"
                         "Зосталася тільки надія одна.", "світ", "Python"))

#Завдання 7: Напишіть функцію, яка приймає довільну кількість списків і з'єднує їх у один великий список

def merge_lists(*args):
    result = []
    for lst in args:
        result.extend(lst)
    return result

print(merge_lists([1, 45], [3, 54], [5, 78]))
